# RenameClass

## Description
Renames the specified class. &lt;BR&gt;
&lt;BR&gt;
All objects assigned to the class being renamed are updated.

```pascal
PROCEDURE RenameClass(
				className : STRING;
				newName   : STRING);
```

```python

def vs.RenameClass(className, newName):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Existing name of the class.|
|newName|STRING|New name for the class.|

## Version
Availability: from VectorWorks8.5
## Category
* Classes